[![pythonista](img/pythonista.png)](https://www.pythonista.io)

# Delta.

In [1]:
import pyspark
from delta import *

builder = pyspark.sql.SparkSession.builder.appName("MyApp") \
    .config("spark.sql.extensions", "io.delta.sql.DeltaSparkSessionExtension") \
    .config("spark.sql.catalog.spark_catalog", "org.apache.spark.sql.delta.catalog.DeltaCatalog")

spark = configure_spark_with_delta_pip(builder).getOrCreate()

In [2]:
spark.sql('''CREATE TABLE IF NOT EXISTS personas 
                 (id INT, nombre CHAR(20), activo BOOLEAN) 
             USING delta;''')

DataFrame[]

In [3]:
spark.sql('''INSERT INTO personas VALUES
             (1001, 'Luis', 'true');''')

DataFrame[]

In [6]:
spark.sql('''SELECT * FROM personas;''').toPandas()

     id nombre  activo
0  1001   Luis    True

In [10]:
spark.sql('''UPDATE personas
                 SET nombre='JUAN'
             WHERE id == 1001;''')
spark.sql('''SELECT * FROM personas;''').toPandas()

     id nombre  activo
0  1001   JUAN    True

In [12]:
spark.sql('''SELECT * FROM personas VERSION AS OF 1;''').toPandas()

     id nombre  activo
0  1001   Luis    True

In [13]:
spark.sql('''SELECT * FROM personas VERSION AS OF 2;''').toPandas()

     id nombre  activo
0  1001   JUAN    True

In [16]:
spark.sql('''RESTORE personas VERSION AS OF 1;;''')
spark.sql('''SELECT * FROM personas;''').toPandas()

     id nombre  activo
0  1001   Luis    True

https://spark.apache.org/docs/latest/sql-ref-syntax-qry-select-setops.html

<p style="text-align: center"><a rel="license" href="http://creativecommons.org/licenses/by/4.0/"><img alt="Licencia Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by/4.0/80x15.png" /></a><br />Esta obra está bajo una <a rel="license" href="http://creativecommons.org/licenses/by/4.0/">Licencia Creative Commons Atribución 4.0 Internacional</a>.</p>
<p style="text-align: center">&copy; José Luis Chiquete Valdivieso. 2023.</p>